

class GlobalOptions(object):
    def __init__(self):
        self.is_debug: bool = False
        # image options
        self.resize: int = 1024

        # gauss blur if need
        self.is_gaussian_blur: bool = False
        self.gauss_filter_size: int = 5
        self.gauss_sigma: float     = 0.6

        # Morfological transform if need
        self.is_image_close: bool = False
        self.close_size: int      = 5

        # canny options
        self.canny_low_threshold: int  = 50
        self.canny_high_threshold: int = 150
        self.connectivity: int         = 8

        # remove short clusters options
        self.remove_short_clusters_threshold: int = 200

        # final border algorithm options
        self.hough_min_votes: int = 130
        self.theta_threshold: int = 50

        # fuzzy logic options
        self.fuzzy_reliability: int = 75

        # Download info from database
        self.is_need_web_info: bool = False
        self.web_database_url: str  = 'https://www.livelib.ru/books/filming/listview/biglist/~'
        self.web_pages_count: int   = 2

        # For ranking func
        self.year_diap = 2024.0 - 1900.0
        self.rank_diap = 10.0
        self.duration_diap = 900.0 # in minutes


# DATA FEATURE
_COUNTRIES_ = ["Австралия", "Австрия", "Азербайджан", "Албания", "Алжир", "Ангола", "Андорра", "Антигуа и Барбуда", "Аргентина", "Армения", "Афганистан", "Багамские Острова", "Бангладеш", "Барбадос", "Бахрейн", "Беларусь", "Белиз", "Бельгия", "Бенин", "Болгария", "Боливия", "Босния и Герцеговина", "Ботсвана", "Бразилия", "Бруней", "Буркина-Фасо", "Бурунди", "Бутан", "Вануату", "Великобритания", "Венгрия", "Венесуэла", "Вьетнам", "Габон", "Гаити", "Гайана", "Гамбия", "Гана", "Гватемала", "Гвинея", "Гвинея-Бисау", "Германия", "Голландия", "Гондурас", "Гонконг", "Гренада", "Греция", "Грузия", "Дания", "Демократическая Республика Конго", "Джибути", "Доминика", "Доминиканская Республика", "Египет", "Замбия", "Зимбабве", "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран", "Ирландия", "Исландия", "Испания", "Италия", "Йемен", "Кабо-Верде", "Казахстан", "Камбоджа", "Камерун", "Канада", "Катар", "Кения", "Кипр", "Кирибати", "Китай", "Колумбия", "Коморы", "Конго", "Коста-Рика", "Кот-д'Ивуар", "Куба", "Кувейт", "Кыргызстан", "Лаос", "Латвия", "Лесото", "Либерия", "Ливан", "Ливия", "Литва", "Лихтенштейн", "Люксембург", "Маврикий", "Мавритания", "Мадагаскар", "Македония", "Малави", "Малайзия", "Мали", "Мальдивы", "Мальта", "Марокко", "Маршалловы Острова", "Мексика", "Микронезия", "Мозамбик", "Молдова", "Монако", "Монголия", "Мьянма", "Намибия", "Науру", "Непал", "Нигер", "Нигерия", "Нидерланды", "Никарагуа", "Новая Зеландия", "Норвегия", "Объединенные Арабские Эмираты", "Оман", "Пакистан", "Палау", "Панама", "Папуа-Новая Гвинея", "Парагвай", "Перу", "Польша", "Португалия", "Россия", "Руанда", "Румыния", "Сальвадор", "Самоа", "Сан-Марино", "Сан-Томе и Принсипи", "Саудовская Аравия", "Свазиленд", "Северная Корея", "Сейшелы", "Сенегал",
"Сербия",
"Сейшельские Острова",
"Сьерра-Леоне",
"Сингапур",
"Синт-Мартен",
"Словакия",
"Словения",
"Соломоновы Острова",
"Сомали",
"Судан",
"Суринам",
"Сьерра-Леоне",
"Сингапур",
"Синт-Мартен",
"Словакия",
"Словения",
"Соломоновы Острова",
"Сомали",
"Судан",
"Суринам",
"США",
"Таджикистан",
"Таиланд",
"Тайвань",
"Танзания",
"Тимор-Лесте",
"Того",
"Токелау",
"Тонга",
"Тринидад и Тобаго",
"Тувалу",
"Тунис",
"Туркменистан",
"Турция",
"Уганда",
"Узбекистан",
"Украина",
"Уоллис и Футуна",
"Уругвай",
"Фарерские острова",
"Фиджи",
"Филиппины",
"Финляндия",
"Фолклендские острова",
"Франция",
"Французская Гвиана",
"Французская Полинезия",
"Французские Южные и Антарктические территории",
"Хорватия",
"Центрально-Африканская Республика",
"Чад",
"Черногория",
"Чехия",
"Чили",
"Швейцария",
"Швеция",
"Шри-Ланка",
"Эквадор",
"Экваториальная Гвинея",
"Эритрея",
"Эсватини",
"Эстония",
"Эфиопия",
"Южная Африка",
"Южная Джорджия и Южные Сандвичевы острова",
"Южная Осетия",
"Южный Судан",
"Ямайка",
"Япония"]

_GENRES_ = ["Комедия", "Драма", "Боевик", "Триллер", "Ужасы", "Фантастика", "Мелодрама", "Криминал", "Исторический", "Анимация", "Аниме", "Исторический", "Фэнтези", "Приключение"]
